app/views/articles/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 6]]
---
        </li>
        <li><small><%= pluralize(@article.user.articles.count, 'article') if @article.user.articles %></small></li>