app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    if @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "This is a new article edited"], ["description", "This is the description of a new article"], ["created_at", "2019-11-05 06:21:34.279930"], ["updated_at", "2019-11-05 06:21:34.279930"]]

  def update
    if @article.update(article_params)
---
UPDATE "articles" SET "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["description", "This is the description 2"], ["updated_at", "2019-11-04 08:38:46.614170"], ["id", 1]]