app/controllers/users_controller.rb

  def index
    @pagy, @users = pagy(User.all, items: 4)
---
SELECT "users".* FROM "users"

  def show
    @user = User.find(params[:id])
    @pagy, @users_articles = pagy(@user.articles.all, items: 4)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 5]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]